app/Filament/Widgets/ManutencoesPorMesChart.php

    protected function getData(): array
    {
        $dados = DB::table('tarefas as t')
            ->selectRaw("strftime('%Y', t.data) AS ano, strftime('%m', t.data) AS mes, COUNT(*) as total")
            ->where('t.tipo_tarefa', 'Manutenção')
            ->groupByRaw("strftime('%Y', t.data), strftime('%m', t.data)")
            ->orderByRaw('ano, mes')
            ->get();
---
select
EXTRACT(YEAR FROM t.data) AS ano,
EXTRACT(MONTH FROM t.data) AS mes,
COUNT(*) as total
from `tarefas` as `t` where `t`.`tipo_tarefa` = 'Manutenção' group by EXTRACT(YEAR FROM t.data), EXTRACT(MONTH FROM t.data) order by ano, mes