app/Filament/Widgets/QuartosSituacaoChart.php

    protected function getData(): array
    {
        $situacaoInfo = [
            'disponivel' => ['label' => 'Disponível', 'color' => '#22c55e'],
            'ocupado' => ['label' => 'Ocupado', 'color' => '#ef4444'],
            'limpeza_em_andamento' => ['label' => 'Em Limpeza', 'color' => '#f59e0b'],
            'manutencao_em_andamento' => ['label' => 'Em Manutenção', 'color' => '#f97316'],
            'finalizada' => ['label' => 'Finalizada', 'color' => '#6b7280'],
            'pedido_encaminhado' => ['label' => 'Pedido Encaminhado', 'color' => '#3b82f6'],
        ];

        $dados = Quarto::query()
            ->select('situacao', DB::raw('count(*) as total'))
            ->groupBy('situacao')
            ->get();
---
select `situacao`, count(*) as total from `quartos` group by `situacao`