app/Filament/Widgets/StatsOverview.php

    protected function getStats(): array
    {
        $quartosDisponiveis = Quarto::where('situacao', 'disponivel')->count();
        $totalQuartos = Quarto::count();
        $tarefasPendentes = Tarefa::whereNull('hora_fim')->count();

        // Ranking do quarto com mais manutenções
        $quartoTopManutencao = DB::table('tarefas as t')
            ->join('quartos as q', 't.quarto_id', '=', 'q.id')
            ->select('q.numero', DB::raw('COUNT(t.id) as total_manutencoes'))
            ->where('t.tipo_tarefa', 'Manutenção')
            ->groupBy('q.numero')
            ->orderByDesc('total_manutencoes')
            ->limit(1)
            ->first();

        // Manutenções por mês e ano
        $manutencoesPorMes = DB::table('tarefas as t')
            ->selectRaw('EXTRACT(YEAR FROM t.data) AS ano, EXTRACT(MONTH FROM t.data) AS mes, COUNT(t.id) AS total_manutencoes')
            ->where('t.tipo_tarefa', 'Manutenção')
            ->groupByRaw('EXTRACT(YEAR FROM t.data), EXTRACT(MONTH FROM t.data)')
            ->orderByRaw('ano, mes')
            ->get();
---
select count(*) as aggregate from `quartos` where `situacao` = 'disponivel'
select count(*) as aggregate from `quartos`
select count(*) as aggregate from `tarefas` where `hora_fim` is null
select EXTRACT(YEAR FROM t.data) AS ano, EXTRACT(MONTH FROM t.data) AS mes, COUNT(t.id) AS total_manutencoes from `tarefas` as `t` where `t`.`tipo_tarefa` = 'Manutenção' group by EXTRACT(YEAR FROM t.data), EXTRACT(MONTH FROM t.data) order by ano, mes
select `q`.`numero`, COUNT(t.id) as total_manutencoes from `tarefas` as `t` inner join `quartos` as `q` on `t`.`quarto_id` = `q`.`id` where `t`.`tipo_tarefa` = 'Manutenção' group by `q`.`numero` order by `total_manutencoes` desc limit 1

        $valorUltimoMes = $ultimoRegistro ? $ultimoRegistro->total_manutencoes : 0;

        // Funcionário que mais atendeu tarefas
        $topFuncionario = DB::table('tarefas as t')
            ->join('users as u', 't.user_id', '=', 'u.id')
            ->select('u.name', DB::raw('COUNT(t.id) as total'))
            ->whereNotNull('t.hora_fim')
            ->groupBy('u.name')
            ->orderByDesc('total')
            ->first();
---
select `u`.`name`, COUNT(t.id) as total from `tarefas` as `t` inner join `users` as `u` on `t`.`user_id` = `u`.`id` where `t`.`hora_fim` is not null group by `u`.`name` order by `total` desc limit 1

                ->descriptionIcon('heroicon-m-clipboard-document-list')
                ->color($tarefasPendentes > 0 ? 'warning' : 'gray'),

            Stat::make('Funcionários Ativos', User::where('situacao', 'disponivel')->count())
                ->description('Equipe disponível para trabalho')
                ->descriptionIcon('heroicon-m-user-group')
                ->color('info'),
---
select count(*) as aggregate from `users` where `situacao` = 'disponivel' and `users`.`deleted_at` is null