app/Filament/Widgets/TopAtendentesChart.php

select `u`.`name`, COUNT(t.id) as total from `tarefas` as `t` inner join `users` as `u` on `t`.`user_id` = `u`.`id` where `t`.`hora_fim` is not null group by `u`.`name` order by `total` desc limit 10
---
    protected function getData(): array
    {
        $dados = DB::table('tarefas as t')
            ->join('users as u', 't.user_id', '=', 'u.id')
            ->select('u.name', DB::raw('COUNT(t.id) as total'))
            ->whereNotNull('t.hora_fim')
            ->groupBy('u.name')
            ->orderByDesc('total')
            ->limit(10)
            ->get();